{
  "subtitle": {
    "text": "Specializing in Next.js, MongoDB & Firebase integrations"
  },
  "resumeButton": {
    "button": "Download Resume"
  },
  "header": {
    "resume": "Resume"
  },
  "stack": {
    "main": "Frontend:",
    "also": "Backend:",
    "database": "Database and Storage:",
    "tools": "Tools & Integrations:"
  },
  "aboutMeSection": {
    "hi": "Hi! I'm",
    "name": "Carlos De Leon",
    "a": "a",
    "student": "Software Engineer",
    "currently": "currently working as a",
    "internship": "Fullstack Developer",
    "atCompany": "at a technology-driven tourism company operating in",
    "company": "Mexico and the Dominican Republic",
    "transition": "Transitioning from",
    "experience": "over 10 years as a COO and General Manager in the restaurant industry",
    "where": "where I led",
    "teams": "teams of up to 100 people",
    "andManaged": "and managed operations with",
    "operations": "USD 1.5 million in monthly revenue with 30% profit margins",
    "today": "Today, I build responsive web applications using",
    "stack": "Next.js, React, TypeScript, Tailwind, MongoDB, JWT, and RESTful APIs",
    "focusing": "focusing on",
    "focus": "clean code and intuitive UI/UX",
    "background": "My operations background brings",
    "skills": "project management, data-driven decision making, and high-performance skills under pressure",
    "end": "to every technical challenge I take on."
  },
  "experienceSection": {
    "title": "Experience",
    "role": "Fullstack Developer",
    "company": "Tourism Tech Solutions • Mexico & Dominican Republic",
    "points": {
      "point1_part1": "Currently working as a",
      "point1_highlight1": "Fullstack Developer",
      "point1_part2": "building production-ready web applications with a strong focus on scalability, security, and user experience for real-world projects using",
      "point1_highlight2": "Next.js, React, TypeScript, Tailwind CSS v4, MongoDB, JWT, and modern APIs",
      "point2_part1": "I have designed and implemented",
      "point2_highlight": "end-to-end frontend and backend architectures",
      "point2_part2": "including secure authentication, role-based access control, Zod validation, state management with TanStack Query, and professional deployments.",
      "point3_part1": "Self-taught engineer with a product-driven mindset,",
      "point3_part2": "trained through official documentation, deep technical reading, complex projects, and coding standards used in professional environments.",
      "point4_part1": "Multilingual communicator:",
      "point4_highlight1": "Spanish (native)",
      "point4_highlight2": "English (C1)",
      "point4_highlight3": "Portuguese (B1)",
      "point4_part2": ", enabling clear technical collaboration with international teams and clients.",
      "point5_part1": "I leverage",
      "point5_highlight": "over 10 years of executive leadership and operational management",
      "point5_part2": "to make sound technical decisions, prioritize effectively, maintain business alignment, and deliver reliable software under pressure."
    },
    "showMore": "Show more",
    "showLess": "Show less",
    "tags": {
      "react": "React",
      "next": "Next.js",
      "tailwind": "Tailwind CSS",
      "astro": "Typescript",
      "rest": "REST APIs",
      "graphql": "GraphQL",
      "firebase": "Firebase",
      "shopify": "Shopify API",
      "framer": "Framer Motion",
      "i18n": "i18n",
      "vercel": "Vercel",
      "github": "GitHub API",
      "zustand": "Zustand",
      "context": "Context API",
      "google": "Google Wallet",
      "apple": "Apple Wallet"
    }
  },
  "openGallery": "Click on the picture to start the slideshow",
  "gallery": "Gallery",
  "tOverview": "Project Overview",
  "projects": {
    "fws": {
      "id": "fws",
      "title": "Ecommerce Next.js, Shopify Headless API",
      "description": "Modern, responsive e-commerce storefront built with Next.js, Tailwind CSS, and Shopify Storefront API. Features clean UI, advanced product browsing, customer reviews with images, wishlist via Firebase, and scalable PWA support with offline use and iOS 'Add to Home Screen' install.",
      "updated": "Updated August 2025",
      "date": "July 2025",
      "techUsed": "Technologies Used",
      "status": "Active Project",
      "statusProject": "Completed",
      "features": "Key Features",
      "projectFeatures": [
        {
          "title": "Real Shopify API Integration",
          "description": "Fetches live product data, prices, and inventory directly from the Shopify Storefront API."
        },
        {
          "title": "Persistent Cart & Wishlist",
          "description": "Stores user-specific carts and wishlists securely in Firebase Firestore for seamless shopping."
        },
        {
          "title": "Cloudinary Image Handling",
          "description": "Supports fast, optimized image uploads for product reviews and user-generated content."
        },
        {
          "title": "i18n Multi-Language Support",
          "description": "Built-in translation system with English and Spanish support using i18next."
        },
        {
          "title": "Framer Motion Page Animations",
          "description": "Smooth transitions and micro-interactions for a polished, modern shopping experience."
        },
        {
          "title": "PWA with Offline Support",
          "description": "App-like experience with offline browsing and “Add to Home Screen” on iOS and Android."
        }
      ],
      "overview": "Koxland Ecommerce is a modern, fully responsive, PWA-ready online store built with Next.js 15, Tailwind CSS v4, Shopify Storefront API, and Firebase Firestore. It’s designed for high performance, scalability, and real-world production use, featuring a persistent shopping cart, user-specific wishlist, product reviews with images (via Cloudinary), and full Shopify checkout integration. The project includes internationalization (i18n), smooth page transitions with Framer Motion, offline support, and the ability to be installed as a mobile app on iOS/Android. It follows a clean, modular architecture optimized for SEO and SSR and is deployed on Vercel. It is an open-source, production-ready e-commerce template for building scalable storefronts with Next.js, Firebase, and Shopify, following best practices for performance, UX, and maintainability."
    },
    "sacbe": {
      "title": "Sacbe Tours, Touristic tours booking",
      "description": "Modern web app for booking tours worldwide. Offers real-time availability, dynamic pricing, and seamless booking through a custom API. Clean, intuitive, and fully responsive UI.",
      "updated": "Updated August 2025",
      "date": "July 2025",
      "type": "WebApp",
      "status": "Active Project",
      "statusProject": "In Progress",
      "features": "Key Features",
      "projectFeatures": [
        {
          "title": "Real-Time Booking Validation",
          "description": "Checks user eligibility with email and reservation code through a secure API request."
        },
        {
          "title": "Region-Based Tour Filtering",
          "description": "Browse tours by destination with dynamic filters for Mexico and Dominican Republic."
        },
        {
          "title": "Apple & Google Wallet Support",
          "description": "Save digital coupons directly to Apple Wallet or Google Wallet for easy access."
        },
        {
          "title": "i18n Multi-Language System",
          "description": "Seamless English and Spanish support using i18next for global travelers."
        },
        {
          "title": "Responsive & Mobile-First UI",
          "description": "Clean, optimized interface designed for travelers on any device."
        },
        {
          "title": "Modular Component Architecture",
          "description": "Scalable React structure for easy maintenance and feature expansion."
        }
      ],
      "overview": "A modern, fully responsive tour booking platform built with Next.js, React, and Tailwind CSS, designed to deliver a seamless travel planning experience. The platform allows users to explore and book tours in top destinations across Mexico and selected locations worldwide. It features a clean, user-friendly interface, dynamic filtering options, and an optimized booking process for travelers on both desktop and mobile devices. Users can browse curated tours with detailed information, pricing, and real-time availability, making it easy to plan trips with confidence. The project is being developed with a scalable, modular architecture to ensure high performance, SEO optimization, and readiness for integrations with APIs such as payment gateways, real-time availability systems, and multi-language support. The platform is currently under active development, with upcoming features including user accounts, personalized recommendations, multi-language support (English/Spanish), and enhanced search capabilities."
    },
    "couponGenerator": {
      "title": "Coupon Generator with API Integration",
      "description": "A responsive web app that fetches promotional coupons from an API, lets users explore offers by region, and generate Apple/Google Wallet passes via dynamic integration.",
      "updated": "Updated August 2025",
      "date": "July 2025",
      "type": "WebApp",
      "status": "Active Project",
      "statusProject": "Completed",
      "features": "Key Features",
      "projectFeatures": [
        {
          "title": "Secure API Reservation Check",
          "description": "Verifies user eligibility using email and booking code before showing coupons."
        },
        {
          "title": "Region-Based Coupon Filtering",
          "description": "Browse and filter offers by destination like Cancún, Tulum, or Punta Cana."
        },
        {
          "title": "Apple & Google Wallet Integration",
          "description": "Save digital coupons directly to Apple Wallet or Google Wallet in one click."
        },
        {
          "title": "i18n Multi-Language Support",
          "description": "Easily switch between English and Spanish using i18next integration."
        },
        {
          "title": "Responsive & Clean UI Design",
          "description": "Optimized for mobile and desktop with a modern, tourist-friendly layout."
        },
        {
          "title": "Component-Based React Structure",
          "description": "Modular and scalable codebase built with React 19, Vite, and Tailwind CSS."
        }
      ],
      "overview": "Coupon Cards is a responsive, multi-language digital coupon platform built with React 19, Vite, and Tailwind CSS 4. It provides tourists in Mexico and the Dominican Republic with easy access to promotional offers from major fast-food chains in premium destinations such as Cancún, Tulum, Los Cabos, Puerto Vallarta, and Punta Cana. The platform verifies user eligibility via an API call that checks the email and reservation code through Sacbe Transfers’ reservation endpoint. Eligible users can browse and filter coupons by region, view promotion details, and save offers directly to Apple Wallet or Google Wallet for convenience on the go. Key features include multi-language support (English/Spanish) using i18next, a clean and mobile-first UI, region-based filtering, and wallet integration. It follows a modular, component-based structure for scalability and maintainability. The project is deployed on Vercel, using ESLint, Prettier, and Tailwind’s Prettier plugin for consistent code formatting. Future improvements include user accounts, an admin panel for coupon management, analytics integration, and support for more tourist destinations."
    },

    "threadhive": {
      "id": "threadhive",
      "title": "ThreadHive, Community Platform",
      "description": "A next-generation community platform combining social discussion with gamification and complete brand identity. ThreadHive demonstrates end-to-end product development from strategic naming and visual design to full-stack implementation. Features include: WoolPath achievement system with 200+ custom-designed badges, NSFW content detection using TensorFlow.js, real-time notifications via Firebase, rich text editing with Tiptap, comprehensive moderation tools with role-based access, and privacy-controlled communities. Tech stack: Next.js 15, React 19, MongoDB, Redux + Zustand + TanStack Query for state management, JWT authentication, and Vercel deployment. Includes complete custom branding (mascot design system, naming strategy, visual identity) conceptualized and executed alongside technical development.",
      "updated": "Updated September 2025",
      "date": "September 2025",
      "techUsed": "Technologies Used",
      "status": "Active Project",
      "statusProject": "In Progress",
      "features": "Key Features",
      "projectFeatures": [
        {
          "title": "Threaded Comments",
          "description": "Interactive comment system with nested replies, visual connectors between users, collapsing threads, and flexible sorting options."
        },
        {
          "title": "Voting System",
          "description": "Upvote and downvote functionality on both posts and comments, encouraging community-driven ranking of content."
        },
        {
          "title": "Subhive Communities",
          "description": "Independent communities with their own branding, privacy levels, member management, and moderation tools."
        },
        {
          "title": "Rich Media Posts",
          "description": "Support for multi-image galleries, responsive embeds, and formatted text content inside posts."
        },
        {
          "title": "Authentication and Roles",
          "description": "JWT-based authentication with role management for users, moderators, and admins to secure communities."
        },
        {
          "title": "Real-Time Experience",
          "description": "Dynamic updates for votes, comments, and community stats without page reloads, enhancing engagement."
        },
        {
          "title": "Framer Motion Animations",
          "description": "Smooth transitions and micro-interactions for a modern and polished user experience across the platform."
        },
        {
          "title": "Session Caching",
          "description": "Smart sessionStorage caching for posts and communities, reducing load times and improving overall performance."
        }
      ],
      "overview": "ThreadHive is a next-generation community platform that reimagines social discussion through comprehensive gamification and unique brand identity. It demonstrates complete end-to-end product development—from strategic branding and visual design to full-stack implementation and production deployment. The platform combines modern social features with an advanced achievement system (WoolPath) featuring 200+ custom-designed badges across 6 rarity tiers, creating engaging user progression and retention. Technical highlights include client-side NSFW content detection using TensorFlow.js, real-time notifications via Firebase Firestore, rich text editing with Tiptap, and sophisticated moderation tools with granular role-based access control (owner, moderator, member, banned, shadowbanned). Built with Next.js 15, React 19, Tailwind CSS v4, and MongoDB Atlas, ThreadHive implements distributed state management combining Redux (authentication), Zustand (UI state), and TanStack Query (server state caching). Features include threaded discussions with visual connectors, multi-image post galleries with Vercel Blob storage, privacy-controlled SubHive communities (public, private, NSFW, official), JWT authentication with refresh tokens, and internationalization support (English/Spanish). The project includes complete custom branding—strategic naming (Thread + Hive), mascot design system with multiple contextual variations, and cohesive visual identity across all platform touchpoints. Optimized for performance with SSR, responsive design for all devices, smooth transitions via Framer Motion, and deployed on Vercel with CI/CD integration. A production-ready demonstration of modern full-stack development, product thinking, and design execution."
    }
  }
}
