{
  "subtitle": {
    "text": "Especializado em integrações com Next.js, MongoDB y Firebase"
  },
  "resumeButton": {
    "button": "Baixar CV"
  },
  "header": {
    "resume": "Currículo"
  },
  "stack": {
    "main": "Frontend:",
    "also": "Backend:",
    "database": "Banco de dados e armazenamento:",
    "tools": "Ferramentas e integrações:"
  },
  "aboutMeSection": {
    "hi": "Olá! Eu sou",
    "name": "Carlos De Leon",
    "a": "um",
    "student": "Engenheiro de Software",
    "currently": "que atualmente trabalha como",
    "internship": "Desenvolvedor Fullstack",
    "atCompany": "em uma empresa de tecnologia voltada ao turismo que opera no",
    "company": "México e na República Dominicana",
    "transition": "Em transição a partir de",
    "experience": "mais de 10 anos como COO e Gerente Geral no setor de restaurantes",
    "where": "onde liderei",
    "teams": "equipes de até 100 pessoas",
    "andManaged": "e gerenciei operações com",
    "operations": "US$ 1,5 milhão em faturamento mensal com margens de lucro de 30%",
    "today": "Hoje, desenvolvo aplicações web responsivas utilizando",
    "stack": "Next.js, React, TypeScript, Tailwind, MongoDB, JWT e APIs RESTful",
    "focusing": "com foco em",
    "focus": "código limpo e UI/UX intuitivo",
    "background": "Minha experiência em operações contribui com",
    "skills": "gestão de projetos, tomada de decisões baseada em dados e habilidades de alto desempenho sob pressão",
    "end": "para cada desafio técnico que enfrento."
  },
  "experienceSection": {
    "title": "Experiência",
    "role": "Desenvolvedor Fullstack",
    "company": "Tourism Tech Solutions • México e República Dominicana",
    "points": {
      "point1_part1": "Atualmente atuo como",
      "point1_highlight1": "Desenvolvedor Fullstack",
      "point1_part2": "desenvolvendo aplicações web prontas para produção com forte foco em escalabilidade, segurança e experiência do usuário para projetos reais utilizando",
      "point1_highlight2": "Next.js, React, TypeScript, Tailwind CSS v4, MongoDB, JWT e APIs modernas",
      "point2_part1": "Projetei e implementei",
      "point2_highlight": "arquiteturas completas de frontend e backend",
      "point2_part2": "incluindo autenticação segura, controle de acesso por papéis, validação com Zod, gerenciamento de estado com TanStack Query e deploys profissionais.",
      "point3_part1": "Engenheiro autodidata com mentalidade orientada a produto,",
      "point3_part2": "formado por meio de documentação oficial, leitura técnica aprofundada, projetos complexos e padrões de código utilizados em ambientes profissionais.",
      "point4_part1": "Comunicador multilíngue:",
      "point4_highlight1": "Espanhol (nativo)",
      "point4_highlight2": "Inglês (C1)",
      "point4_highlight3": "Português (B1)",
      "point4_part2": ", possibilitando colaboração técnica clara com equipes e clientes internacionais.",
      "point5_part1": "Integro",
      "point5_highlight": "mais de 10 anos de liderança executiva e gestão operacional",
      "point5_part2": "para tomar decisões técnicas sólidas, definir prioridades corretamente, manter alinhamento com o negócio e entregar software confiável sob pressão."
    },
    "showMore": "Mostrar mais",
    "showLess": "Mostrar menos",
    "tags": {
      "react": "React",
      "next": "Next.js",
      "tailwind": "Tailwind CSS",
      "astro": "Typescript",
      "rest": "APIs REST",
      "graphql": "GraphQL",
      "firebase": "Firebase",
      "shopify": "Shopify API",
      "framer": "Framer Motion",
      "i18n": "i18n",
      "vercel": "Vercel",
      "github": "GitHub API",
      "zustand": "Zustand",
      "context": "Context API",
      "google": "Google Wallet",
      "apple": "Apple Wallet"
    }
  },
  "gallery": "Galeria",
  "openGallery": "Clique na imagem para ver a galeria",
  "tOverview": "Descrição do Projeto",
  "projects": {
    "fws": {
      "title": "FitWorld Shop",
      "description": "Loja online moderna e responsiva criada com Next.js, Tailwind CSS e Shopify Storefront API. Inclui uma UI limpa, navegação avançada de produtos, avaliações com imagens, lista de desejos integrada ao Firebase e suporte a PWA com uso offline e instalação em iOS.",
      "updated": "Atualizado em agosto de 2025",
      "date": "Julho de 2025",
      "techUsed": "Tecnologias Utilizadas",
      "status": "Projeto Ativo",
      "statusProject": "Concluído",
      "features": "Principais Funcionalidades",
      "projectFeatures": [
        {
          "title": "Integração real com a API da Shopify",
          "description": "Obtém dados de produtos, preços e inventário em tempo real diretamente da Shopify Storefront API."
        },
        {
          "title": "Carrinho e lista de desejos persistentes",
          "description": "Armazena de forma segura os carrinhos e listas de desejos de cada usuário no Firebase Firestore, proporcionando uma experiência de compra contínua."
        },
        {
          "title": "Gerenciamento de imagens com Cloudinary",
          "description": "Permite uploads rápidos e otimizados de imagens para avaliações de produtos e conteúdo gerado por usuários."
        },
        {
          "title": "Suporte multilíngue com i18n",
          "description": "Sistema de tradução integrado com suporte a inglês e espanhol por meio do i18next."
        },
        {
          "title": "Animações com Framer Motion",
          "description": "Transições suaves e interações sutis para uma experiência moderna e envolvente."
        },
        {
          "title": "PWA com suporte offline",
          "description": "Experiência similar a um aplicativo, com navegação offline e opção de 'Adicionar à tela inicial' em iOS e Android."
        }
      ],
      "overview": "Koxland Ecommerce é uma loja online moderna, totalmente responsiva e pronta para PWA, desenvolvida com Next.js 15, Tailwind CSS v4, Shopify Storefront API e Firebase Firestore. Projetada para oferecer alto desempenho, escalabilidade e uso em ambientes de produção reais, inclui funcionalidades como carrinho de compras persistente, lista de desejos por usuário, avaliações de produtos com imagens (via Cloudinary) e integração completa com o checkout da Shopify. O projeto conta com internacionalização (i18n), transições de página suaves com Framer Motion, suporte offline e possibilidade de instalação como aplicativo móvel em iOS e Android. Segue uma arquitetura modular e limpa, otimizada para SEO e renderização no lado do servidor (SSR), e está hospedada na Vercel. É um template de e-commerce de código aberto, pronto para produção, para criar lojas escaláveis com Next.js, Firebase e Shopify, seguindo as melhores práticas de desempenho, experiência do usuário (UX) e manutenção."
    },
    "sacbe": {
      "title": "Sacbe Tours, Reserva de passeios turísticos",
      "description": "Aplicação web moderna para reservar passeios em todo o mundo. Oferece disponibilidade em tempo real, preços dinâmicos e reservas simples por meio de uma API personalizada. Interface limpa, intuitiva e totalmente responsiva.",
      "updated": "Atualizado em agosto de 2025",
      "date": "Julho de 2025",
      "type": "Aplicação Web",
      "status": "Projeto Ativo",
      "statusProject": "Concluído",
      "features": "Principais Funcionalidades",
      "projectFeatures": [
        {
          "title": "Validação de reservas em tempo real",
          "description": "Verifica a elegibilidade do usuário por e-mail e código de reserva usando uma API segura."
        },
        {
          "title": "Filtragem de passeios por região",
          "description": "Permite explorar passeios por destino com filtros dinâmicos para México e República Dominicana."
        },
        {
          "title": "Compatibilidade com Apple e Google Wallet",
          "description": "Salva cupons digitais diretamente no Apple Wallet ou Google Wallet para acesso rápido."
        },
        {
          "title": "Sistema multilíngue com i18n",
          "description": "Suporte fluido para inglês e espanhol integrado ao i18next."
        },
        {
          "title": "Interface responsiva e mobile-first",
          "description": "Design limpo e otimizado para oferecer a melhor experiência em qualquer dispositivo."
        },
        {
          "title": "Arquitetura modular baseada em componentes",
          "description": "Estrutura escalável em React para facilitar manutenção e expansão de funcionalidades."
        }
      ],
      "overview": "Uma plataforma moderna e totalmente responsiva para reserva de passeios, desenvolvida com Next.js, React e Tailwind CSS, projetada para oferecer uma experiência de planejamento de viagens simples e eficiente. Permite aos usuários explorar e reservar passeios nos principais destinos do México e em outras localidades ao redor do mundo. Possui interface limpa e fácil de usar, opções dinâmicas de filtragem e um processo de reserva otimizado para desktop e dispositivos móveis. Os usuários podem explorar passeios selecionados com detalhes completos, preços e disponibilidade em tempo real, facilitando o planejamento de viagens com confiança. O projeto segue uma arquitetura modular e escalável, garantindo alto desempenho, SEO otimizado e preparo para integrações futuras, como gateways de pagamento, sistemas de disponibilidade em tempo real e suporte multilíngue. Atualmente, está em desenvolvimento ativo, com recursos futuros planejados, incluindo contas de usuário, recomendações personalizadas, busca aprimorada e mais idiomas."
    },
    "couponGenerator": {
      "title": "Gerador de Cupons e integração de API",
      "description": "Aplicação web responsiva que obtém cupons promocionais de uma API, permite explorar ofertas por região e gerar passes para Apple/Google Wallet com integração dinâmica.",
      "updated": "Atualizado em agosto de 2025",
      "date": "Julho de 2025",
      "type": "Aplicação Web",
      "status": "Projeto Ativo",
      "statusProject": "Concluído",
      "features": "Principais Funcionalidades",
      "projectFeatures": [
        {
          "title": "Verificação de reservas com API segura",
          "description": "Confere a elegibilidade do usuário por e-mail e código de reserva antes de exibir os cupons."
        },
        {
          "title": "Filtragem de cupons por região",
          "description": "Permite explorar e filtrar ofertas por destinos como Cancún, Tulum e Punta Cana."
        },
        {
          "title": "Integração com Apple e Google Wallet",
          "description": "Salva cupons digitais diretamente no Apple Wallet ou Google Wallet com um único clique."
        },
        {
          "title": "Suporte multilíngue com i18n",
          "description": "Permite alternar facilmente entre inglês e espanhol usando a integração com i18next."
        },
        {
          "title": "Design limpo e responsivo",
          "description": "Otimizado para dispositivos móveis e desktop, com uma interface moderna e fácil de usar."
        },
        {
          "title": "Arquitetura modular baseada em componentes",
          "description": "Código escalável e organizado, construído com React 19, Vite e Tailwind CSS."
        }
      ],
      "overview": "Coupon Cards é uma plataforma digital de cupons, responsiva e multilíngue, desenvolvida com React 19, Vite e Tailwind CSS 4. Proporciona aos turistas no México e na República Dominicana acesso fácil a ofertas promocionais das principais redes de fast food em destinos como Cancún, Tulum, Los Cabos, Puerto Vallarta e Punta Cana. A plataforma verifica a elegibilidade do usuário por meio de uma chamada a uma API que valida e-mail e código de reserva pelo endpoint de reservas da Sacbe Transfers. Usuários elegíveis podem explorar e filtrar cupons por região, visualizar detalhes das promoções e salvar as ofertas diretamente no Apple Wallet ou Google Wallet para maior conveniência durante a viagem. Entre as principais funcionalidades estão o suporte multilíngue (inglês/espanhol) usando i18next, interface limpa e mobile-first, filtragem por região e integração com Apple e Google Wallet. O projeto segue uma estrutura modular baseada em componentes, garantindo escalabilidade e facilidade de manutenção. Está hospedado na Vercel e utiliza ESLint, Prettier e o plugin Prettier para Tailwind para manter a consistência do código. Futuras melhorias incluirão contas de usuário, painel administrativo para gestão de cupons, integração de análises e suporte a mais destinos turísticos."
    },

    "threadhive": {
      "id": "threadhive",
      "title": "ThreadHive",
      "description": "Uma plataforma moderna de discussão impulsionada pela comunidade, construída com Next.js, Tailwind CSS, MongoDB, autenticação JWT e Redux. Inclui comentários em tópicos com conectores visuais, sistema de votos em tempo real, subcomunidades com controles de privacidade, postagens com galerias multimídia e uma interface responsiva aprimorada com animações do Framer Motion.",
      "updated": "Atualizado em setembro de 2025",
      "date": "Setembro de 2025",
      "techUsed": "Tecnologias utilizadas",
      "status": "Projeto ativo",
      "statusProject": "Em andamento",
      "features": "Principais características",
      "projectFeatures": [
        {
          "title": "Comentários em Tópicos",
          "description": "Sistema interativo de comentários com respostas aninhadas, conectores visuais entre usuários, colapso de tópicos e opções flexíveis de ordenação."
        },
        {
          "title": "Sistema de Votação",
          "description": "Funcionalidade de votos positivos e negativos em postagens e comentários, incentivando a classificação de conteúdo orientada pela comunidade."
        },
        {
          "title": "Subhives (Comunidades)",
          "description": "Comunidades independentes com identidade visual própria, níveis de privacidade, gerenciamento de membros e ferramentas de moderação."
        },
        {
          "title": "Postagens Multimídia",
          "description": "Suporte para galerias com múltiplas imagens, incorporações responsivas e texto formatado dentro das postagens."
        },
        {
          "title": "Autenticação e Funções",
          "description": "Autenticação baseada em JWT com gerenciamento de funções para usuários, moderadores e administradores, garantindo segurança nas comunidades."
        },
        {
          "title": "Experiência em Tempo Real",
          "description": "Atualizações dinâmicas para votos, comentários e estatísticas das comunidades sem recarregar a página, aprimorando a interação do usuário."
        },
        {
          "title": "Animações com Framer Motion",
          "description": "Transições suaves e microinterações que proporcionam uma experiência moderna e refinada em toda a plataforma."
        },
        {
          "title": "Cache de Sessão",
          "description": "Cache inteligente em sessionStorage para postagens e comunidades, reduzindo o tempo de carregamento e melhorando o desempenho geral."
        }
      ],
      "overview": "ThreadHive é uma plataforma de discussão moderna, totalmente responsiva e voltada para a comunidade, construída com Next.js 15, Tailwind CSS v4, MongoDB e autenticação JWT. Projetada para escalabilidade, desempenho e uso em produção real, oferece comentários em tópicos com conectores visuais, votos em tempo real, subcomunidades com controles de privacidade e postagens multimídia com galerias de imagens. O projeto inclui internacionalização (i18n), transições suaves com Framer Motion, suporte offline e design otimizado para todos os dispositivos. Segue uma arquitetura modular limpa com SSR para otimização de SEO e está implantado na Vercel. É um modelo de plataforma social open source, pronto para produção, para criar comunidades online escaláveis com Next.js, MongoDB e JWT, seguindo as melhores práticas de desempenho, UX e manutenção."
    },

    "beehealth": {
      "title": "BeeHealth",
      "description": "Sistema completo de gestão para clínicas multi-especialidade com gestão de pacientes, consultas, estoque, contabilidade e fluxos clínicos.",
      "updated": "Atualizado",
      "date": "Dezembro 2025",
      "type": "Aplicação Web SaaS",
      "status": "Em desenvolvimento ativo",
      "statusProject": "Beta privado",
      "overview": "BeeHealth é um sistema de gestão médica projetado para clínicas que atendem múltiplas especialidades como emagrecimento, odontologia e estética. Oferece controle completo de prontuários clínicos, agendamento de consultas, estoque com rastreabilidade, contabilidade integrada e acesso baseado em funções para diferentes tipos de usuários.",
      "features": "Gestão de pacientes • Prontuários clínicos digitais • Sistema de agendamento • Controle de estoque • Contabilidade integrada • Linha do tempo do paciente • Atribuição de dietas e treinos • Sistema de notificações • Controle de acesso por função • Compatível com PWA",
      "projectFeatures": [
        "Dashboard personalizado por função (Admin, Médico, Recepção, Paciente)",
        "Prontuários clínicos com histórico completo e linha do tempo visual",
        "Sistema de agendamento com calendário e lembretes",
        "Estoque com transações e alertas de quantidade",
        "Módulo de peso com acompanhamento de progresso e gráficos",
        "Atribuição de planos de dieta e exercícios",
        "Sistema de notificações em tempo real",
        "Relatórios e análises por especialidade",
        "Multi-clínica / Multi-tenant ready"
      ]
    }
  }
}
