{
  "subtitle": {
    "text": "Especializado en integraciones con Next.js, MongoDB y Firebase"
  },
  "resumeButton": {
    "button": "Descargar CV"
  },
  "header": {
    "resume": "Curriculum"
  },
  "stack": {
    "main": "Frontend:",
    "also": "Backend:",
    "database": "Base de datos y Almacenamiento:",
    "tools": "Herramientas e integraciones:"
  },
  "aboutMeSection": {
    "hi": "¡Hola! Soy",
    "name": "Carlos De Leon",
    "a": "un",
    "student": "Ingeniero de Software",
    "currently": "que actualmente trabaja como ",
    "internship": "Fullstack Developer",
    "atCompany": "en una empresa tecnológica de turismo que opera en",
    "company": "México y República Dominicana",
    "transition": "Transicionando desde",
    "experience": "más de 10 años como COO y Gerente General de restaurantes",
    "where": "donde lideré",
    "teams": "equipos de hasta 100 personas",
    "andManaged": "y gestioné operaciones con",
    "operations": "1.5 millones de USD en ingresos mensuales con márgenes de ganancia del 30%",
    "today": "Hoy en día, desarrollo aplicaciones web responsivas con",
    "stack": "Next.js, React, Typescript, Tailwind, MongoDB, JWT y APIs RESTful",
    "focusing": "enfocándome en",
    "focus": "código limpio y UI/UX intuitivo",
    "background": "Mi experiencia en operaciones aporta",
    "skills": "gestión de proyectos, toma de decisiones basada en datos y habilidades de alto rendimiento bajo presión",
    "end": "a cada reto técnico que enfrento."
  },
  "experienceSection": {
    "title": "Experiencia",
    "role": "Desarrollador Fullstack",
    "company": "Tourism Tech Solutions • México y República Dominicana",
    "points": {
      "point1_part1": "Actualmente trabajo como",
      "point1_highlight1": "Fullstack Developer",
      "point1_part2": "desarrollando aplicaciones web listas para producción con enfoque en escalabilidad, seguridad y experiencia de usuario para proyectos reales usando",
      "point1_highlight2": "Next.js, React, TypeScript, Tailwind CSS v4, MongoDB, JWT y APIs modernas",
      "point2_part1": "He diseñado e implementado",
      "point2_highlight": "arquitecturas completas de frontend y backend",
      "point2_part2": "incluyendo autenticación segura, control de roles, validación con Zod, manejo de estado con TanStack Query y despliegues profesionales.",
      "point3_part1": "Ingeniero autodidacta con mentalidad de producto,",
      "point3_part2": "formado a través de documentación oficial, lectura técnica profunda, proyectos complejos y estándares de código usados en entornos profesionales.",
      "point4_part1": "Comunicador multilingüe:",
      "point4_highlight1": "Español (nativo)",
      "point4_highlight2": "Inglés (C1)",
      "point4_highlight3": "Portugués (B1)",
      "point4_part2": ", facilitando colaboración técnica clara con equipos y clientes internacionales.",
      "point5_part1": "Integro",
      "point5_highlight": "más de 10 años de liderazgo ejecutivo y gestión operativa",
      "point5_part2": "para tomar decisiones técnicas sólidas, priorizar correctamente, mantener visión de negocio y entregar software confiable bajo presión."
    },
    "showMore": "Mostrar más",
    "showLess": "Mostrar menos",
    "tags": {
      "next": "Next.js",
      "react": "React",
      "tailwind": "Tailwind CSS",
      "astro": "Typescript",
      "rest": "APIs REST",
      "graphql": "GraphQL",
      "firebase": "Firebase",
      "shopify": "Shopify API",
      "framer": "Framer Motion",
      "i18n": "i18n",
      "vercel": "Vercel",
      "github": "GitHub API",
      "zustand": "Zustand",
      "context": "Context API",
      "google": "Google Wallet",
      "apple": "Apple Wallet"
    }
  },
  "gallery": "Galeria",
  "openGallery": "Haz clic en la imagen para ver la galería",
  "tOverview": "Descripcion del Proyecto",
  "projects": {
    "fws": {
      "title": "FitWorld Shop",
      "description": "Tienda en línea moderna y responsiva creada con Next.js, Tailwind CSS y Shopify Storefront API. Incluye UI limpia, navegación avanzada de productos, reseñas con imágenes, wishlist con Firebase y soporte PWA con uso offline e instalación en iOS.",
      "updated": "Actualizado Agosto 2025",
      "date": "Julio 2025",
      "techUsed": "Tecnologias Usadas",
      "status": "Proyecto Activo",
      "statusProject": "Completed",
      "features": "Features Principales",
      "projectFeatures": [
        {
          "title": "Integración real con la API de Shopify",
          "description": "Obtiene datos de productos, precios e inventario en tiempo real directamente desde la Shopify Storefront API."
        },
        {
          "title": "Carrito y lista de deseos persistentes",
          "description": "Guarda los carritos y listas de deseos específicos de cada usuario de forma segura en Firebase Firestore para una experiencia de compra fluida."
        },
        {
          "title": "Gestión de imágenes con Cloudinary",
          "description": "Permite cargas rápidas y optimizadas de imágenes para reseñas de productos y contenido generado por usuarios."
        },
        {
          "title": "Soporte multilenguaje con i18n",
          "description": "Sistema de traducción incorporado con soporte para inglés y español mediante i18next."
        },
        {
          "title": "Animaciones con Framer Motion",
          "description": "Transiciones fluidas e interacciones sutiles para una experiencia moderna y atractiva."
        },
        {
          "title": "PWA con soporte offline",
          "description": "Experiencia tipo aplicación con navegación sin conexión y opción de “Agregar a la pantalla de inicio” en iOS y Android."
        }
      ],
      "overview": "Koxland Ecommerce es una tienda en línea moderna, totalmente responsiva y lista para PWA, desarrollada con Next.js 15, Tailwind CSS v4, Shopify Storefront API y Firebase Firestore. Está diseñada para ofrecer alto rendimiento, escalabilidad y uso en entornos de producción reales, con funciones como carrito de compras persistente, lista de deseos por usuario, reseñas de productos con imágenes (mediante Cloudinary) e integración completa con el checkout de Shopify. El proyecto incluye internacionalización (i18n), transiciones de página fluidas con Framer Motion, soporte offline y la posibilidad de instalarse como aplicación móvil en iOS y Android. Sigue una arquitectura modular y limpia, optimizada para SEO y renderizado del lado del servidor (SSR), y está desplegado en Vercel. Es una plantilla de comercio electrónico de código abierto, lista para producción, para crear tiendas escalables con Next.js, Firebase y Shopify, siguiendo las mejores prácticas de rendimiento, experiencia de usuario (UX) y mantenibilidad."
    },
    "sacbe": {
      "title": "Sacbe Tours, Reserva de tours turisticos",
      "description": "Aplicación web moderna para reservar tours en todo el mundo. Ofrece disponibilidad en tiempo real, precios dinámicos y reservas sin complicaciones a través de una API personalizada. Interfaz limpia, intuitiva y totalmente responsiva.",
      "updated": "Actualizado en agosto de 2025",
      "date": "Julio 2025",
      "type": "Aplicación Web",
      "status": "Proyecto Activo",
      "statusProject": "Completed",
      "features": "Features Principales",
      "projectFeatures": [
        {
          "title": "Validación de reservas en tiempo real",
          "description": "Verifica la elegibilidad del usuario mediante correo electrónico y código de reservación a través de una API segura."
        },
        {
          "title": "Filtrado de tours por región",
          "description": "Permite explorar tours por destino con filtros dinámicos para México y República Dominicana."
        },
        {
          "title": "Compatibilidad con Apple y Google Wallet",
          "description": "Guarda cupones digitales directamente en Apple Wallet o Google Wallet para un acceso sencillo."
        },
        {
          "title": "Sistema multilenguaje con i18n",
          "description": "Soporte fluido para inglés y español mediante integración con i18next."
        },
        {
          "title": "Interfaz responsiva y móvil primero",
          "description": "Diseño limpio y optimizado para ofrecer la mejor experiencia en cualquier dispositivo."
        },
        {
          "title": "Arquitectura modular basada en componentes",
          "description": "Estructura escalable en React para facilitar el mantenimiento y la expansión de funcionalidades."
        }
      ],
      "overview": "Una plataforma moderna y totalmente responsiva para la reserva de tours, desarrollada con Next.js, React y Tailwind CSS, diseñada para ofrecer una experiencia de planificación de viajes fluida. La plataforma permite a los usuarios explorar y reservar tours en los principales destinos de México y en ubicaciones seleccionadas alrededor del mundo. Cuenta con una interfaz limpia y fácil de usar, opciones dinámicas de filtrado y un proceso de reservación optimizado para viajeros tanto en escritorio como en dispositivos móviles. Los usuarios pueden explorar tours seleccionados con detalles completos, precios y disponibilidad en tiempo real, facilitando la planificación de viajes con confianza. El proyecto está siendo desarrollado con una arquitectura modular y escalable, asegurando un alto rendimiento, optimización para SEO y preparación para integraciones con APIs como pasarelas de pago, sistemas de disponibilidad en tiempo real y soporte multilenguaje. Actualmente, la plataforma está en desarrollo activo, con próximas funciones que incluirán cuentas de usuario, recomendaciones personalizadas, soporte multilenguaje (inglés/español) y capacidades de búsqueda mejoradas."
    },
    "couponGenerator": {
      "title": "Generador de Cupones e integracion de API",
      "description": "Aplicación web responsiva que obtiene cupones promocionales desde una API, permite explorar ofertas por región y generar pases de Apple/Google Wallet mediante integración dinámica.",
      "updated": "Actualizado en agosto de 2025",
      "date": "Julio 2025",
      "type": "Aplicación Web",
      "status": "Proyecto Activo",
      "statusProject": "Completed",
      "features": "Features Principales",
      "projectFeatures": [
        {
          "title": "Verificación de reservas con API segura",
          "description": "Comprueba la elegibilidad del usuario mediante correo y código de reservación antes de mostrar los cupones."
        },
        {
          "title": "Filtrado de cupones por región",
          "description": "Permite explorar y filtrar ofertas por destinos como Cancún, Tulum o Punta Cana."
        },
        {
          "title": "Integración con Apple y Google Wallet",
          "description": "Guarda cupones digitales directamente en Apple Wallet o Google Wallet con un solo clic."
        },
        {
          "title": "Soporte multilenguaje con i18n",
          "description": "Permite cambiar fácilmente entre inglés y español usando la integración con i18next."
        },
        {
          "title": "Diseño limpio y responsivo",
          "description": "Optimizado para dispositivos móviles y escritorio con una interfaz moderna y fácil de usar."
        },
        {
          "title": "Arquitectura modular basada en componentes",
          "description": "Código escalable y organizado construido con React 19, Vite y Tailwind CSS."
        }
      ],
      "overview": "Coupon Cards es una plataforma digital de cupones, responsiva y multilenguaje, desarrollada con React 19, Vite y Tailwind CSS 4. Proporciona a los turistas en México y la República Dominicana un acceso sencillo a ofertas promocionales de las principales cadenas de comida rápida en destinos premium como Cancún, Tulum, Los Cabos, Puerto Vallarta y Punta Cana. La plataforma verifica la elegibilidad del usuario mediante una llamada a una API que valida el correo electrónico y el código de reservación a través del endpoint de reservaciones de Sacbe Transfers. Los usuarios elegibles pueden explorar y filtrar cupones por región, ver los detalles de las promociones y guardar las ofertas directamente en Apple Wallet o Google Wallet para mayor comodidad durante su viaje. Sus principales características incluyen soporte multilenguaje (inglés/español) usando i18next, una interfaz limpia y enfocada en dispositivos móviles, filtrado por región e integración con Apple y Google Wallet. Sigue una estructura modular y basada en componentes para garantizar escalabilidad y facilidad de mantenimiento. El proyecto está desplegado en Vercel y utiliza ESLint, Prettier y el plugin de Prettier para Tailwind para mantener un formato de código consistente. Las futuras mejoras incluirán cuentas de usuario, un panel de administración para la gestión de cupones, integración de analíticas y soporte para más destinos turísticos."
    },

    "threadhive": {
      "id": "threadhive",
      "title": "ThreadHive",
      "description": "Una plataforma moderna de discusión impulsada por la comunidad, construida con Next.js, Tailwind CSS, MongoDB, autenticación JWT y Redux. Incluye comentarios en hilos con conectores visuales, votaciones en tiempo real, subcomunidades con controles de privacidad, publicaciones con galerías multimedia y una interfaz adaptable potenciada por animaciones de Framer Motion.",
      "updated": "Actualizado en septiembre de 2025",
      "date": "Septiembre de 2025",
      "techUsed": "Tecnologías utilizadas",
      "status": "Proyecto activo",
      "statusProject": "En progreso",
      "features": "Características principales",
      "projectFeatures": [
        {
          "title": "Comentarios en Hilos",
          "description": "Sistema interactivo de comentarios con respuestas anidadas, conectores visuales entre usuarios, colapsado de hilos y opciones de ordenamiento flexibles."
        },
        {
          "title": "Sistema de Votación",
          "description": "Funcionalidad de votos positivos y negativos tanto en publicaciones como en comentarios, fomentando el ranking de contenido impulsado por la comunidad."
        },
        {
          "title": "Subhives (Comunidades)",
          "description": "Comunidades independientes con su propia identidad visual, niveles de privacidad, gestión de miembros y herramientas de moderación."
        },
        {
          "title": "Publicaciones Multimedia",
          "description": "Soporte para galerías de múltiples imágenes, incrustaciones responsivas y texto con formato dentro de las publicaciones."
        },
        {
          "title": "Autenticación y Roles",
          "description": "Autenticación basada en JWT con gestión de roles para usuarios, moderadores y administradores, garantizando la seguridad de las comunidades."
        },
        {
          "title": "Experiencia en Tiempo Real",
          "description": "Actualizaciones dinámicas para votos, comentarios y estadísticas de comunidades sin recargar la página, mejorando la interacción del usuario."
        },
        {
          "title": "Animaciones con Framer Motion",
          "description": "Transiciones suaves y microinteracciones que ofrecen una experiencia moderna y pulida en toda la plataforma."
        },
        {
          "title": "Caché de Sesión",
          "description": "Caché inteligente en sessionStorage para publicaciones y comunidades, reduciendo los tiempos de carga y mejorando el rendimiento general."
        }
      ],
      "overview": "ThreadHive es una plataforma de discusión moderna, totalmente adaptable y orientada a la comunidad, construida con Next.js 15, Tailwind CSS v4, MongoDB y autenticación JWT. Está diseñada para escalabilidad, rendimiento y uso en producción real, ofreciendo comentarios en hilos con conectores visuales, votaciones en tiempo real, subcomunidades con controles de privacidad y publicaciones multimedia con galerías de imágenes. El proyecto incluye internacionalización (i18n), transiciones suaves con Framer Motion, soporte offline y un diseño optimizado para todos los dispositivos. Sigue una arquitectura modular limpia con SSR para optimización SEO y está desplegado en Vercel. Es una plantilla de plataforma social lista para producción y de código abierto para construir comunidades en línea escalables con Next.js, MongoDB y JWT, siguiendo las mejores prácticas de rendimiento, UX y mantenibilidad."
    },

    "beehealth": {
      "title": "BeeHealth",
      "description": "Una plataforma completa de gestión de consultorios médicos diseñada para clínicas multi-especialidad. Maneja expedientes de pacientes, citas, flujos de trabajo clínicos, inventario y contabilidad con acceso basado en roles para doctores, empleados y pacientes.",
      "updated": "Actualizado",
      "date": "Diciembre 2025",
      "type": "Aplicación Web SaaS",
      "status": "En desarrollo activo",
      "statusProject": "Beta privada",
      "overview": "BeeHealth es un sistema listo para producción actualmente utilizado por clínicas médicas en México. La plataforma implementa autorización híbrida RBAC + ABAC, donde el acceso es controlado tanto por rol como por especialidad (peso, dental, estética). Los doctores obtienen interfaces clínicas personalizables con ordenamiento de campos mediante drag-and-drop que persiste por perfil de usuario. El sistema incluye una línea de tiempo completa del paciente que rastrea todos los eventos: consultas, prescripciones, asignaciones de dietas y ejercicios, con auditoría completa. La gestión de inventario registra cada transacción con fecha, usuario y razón. Las citas se sincronizan en tiempo real con Google Calendar API a través de múltiples calendarios por especialidad. Construido con Next.js 16, React 19, TypeScript, MongoDB, y desplegado en Vercel.",
      "features": "Características Principales",
      "projectFeatures": [
        {
          "title": "Dashboards por Rol",
          "description": "Aislamiento completo de módulos para doctores, empleados y pacientes. Cada rol tiene rutas dedicadas, componentes de UI y permisos con redirecciones automáticas mediante ServerRoleGuard."
        },
        {
          "title": "Gestión de Expedientes Clínicos",
          "description": "Expedientes de pacientes completos con campos personalizables, seguimiento de historial médico, y una línea de tiempo completa mostrando consultas, prescripciones y cambios de tratamiento."
        },
        {
          "title": "Personalización de UI con Drag-and-Drop",
          "description": "Los doctores pueden configurar su interfaz clínica reordenando campos con drag-and-drop. Las preferencias persisten por perfil de usuario en MongoDB."
        },
        {
          "title": "Integración con Google Calendar",
          "description": "Programación de citas en tiempo real sincronizada con Google Calendar API. Soporta múltiples calendarios por especialidad con detección de citas del mismo día."
        },
        {
          "title": "Gestión de Inventario",
          "description": "Control completo de stock para medicamentos y suministros con alertas de stock bajo. Cada transacción se registra con fecha, usuario y razón para auditoría completa."
        },
        {
          "title": "Asignación de Dietas y Ejercicios",
          "description": "Crea, edita y asigna planes de dieta y ejercicio a pacientes. Los pacientes solo ven su contenido asignado con seguimiento de activación y cumplimiento."
        },
        {
          "title": "Seguimiento de Peso con Gráficas",
          "description": "Seguimiento visual del progreso para pacientes de control de peso con datos históricos mostrados en gráficas interactivas de Recharts."
        },
        {
          "title": "Módulo de Contabilidad",
          "description": "Seguimiento financiero completo con reportes de ingresos diarios y semanales, desglose de consultas vs ventas de productos, y manejo de reversiones por cancelación de citas."
        },
        {
          "title": "Autorización Híbrida RBAC + ABAC",
          "description": "Acceso controlado tanto por rol como por atributo de especialidad. Los doctores solo acceden a pacientes de su especialidad (peso, dental, estética) con validación del lado del servidor."
        },
        {
          "title": "Autenticación JWT de Token Dual",
          "description": "Autenticación segura con tokens de acceso de 15 minutos y tokens de refresco de 7 días almacenados en cookies httpOnly. Toda la validación ocurre del lado del servidor."
        },
        {
          "title": "Gestión de Consultas",
          "description": "Flujo de trabajo completo de consultas con campos configurables, capacidad de vincular consultas con dietas, ejercicios y prescripciones, además de notas médicas y seguimiento."
        },
        {
          "title": "Soporte Multi-Especialidad",
          "description": "Diseñado para clínicas que manejan múltiples especialidades (peso, dental, estética) con enrutamiento basado en especialidad y acceso filtrado a pacientes."
        }
      ]
    }
  }
}
